УТ_для_edt.ДоставкаДеловыеЛинии/src/Documents/ДЛ_ЗаявкаНаДоставку/ДЛ_ЗаявкаНаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДЛ_ЗаявкаНаДоставку</name>
  <basedOn>Document.ВозвратТоваровПоставщику</basedOn>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ЗаявкаНаВозвратТоваровОтКлиента</basedOn>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказНаПеремещение</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.КорректировкаРеализации</basedOn>
  <basedOn>Document.ТранспортнаяНакладная</basedOn>
  <basedOn>Document.РасходныйОрдерНаТовары</basedOn>
  <basedOn>Document.ПриходныйОрдерНаТовары</basedOn>
  <basedOn>Document.КорректировкаПриобретения</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаказНаПеремещение</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.РасходныйОрдерНаТовары</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.КорректировкаПриобретения</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.ТранспортнаяНакладная</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
        <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.ДоставкаДеловыеЛинии/src/Catalogs/ДЛ_ПараметрыНГГ/ДЛ_ПараметрыНГГ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДЛ_ПараметрыНГГ</name>
  <attributes>
    <name>Длина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.ДоставкаДеловыеЛинии/src/Documents/ДЛ_ЗаявкаНаДоставку/Forms/ПараметрыНегабаритногоГруза/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуНГГ();
	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьТаблицуНГГ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДЛ_ПараметрыНГГ.Наименование = ""auto""
	|			ТОГДА ""Автодоставка""
	|		КОГДА ДЛ_ПараметрыНГГ.Наименование = ""avia""
	|			ТОГДА ""Авиадоставка""
	|		КОГДА ДЛ_ПараметрыНГГ.Наименование = ""cargo_small""
	|			ТОГДА ""Малогабаритный груз""
	|		КОГДА ДЛ_ПараметрыНГГ.Наименование = ""express""
	|			ТОГДА ""Экспресс-доставка""
	|		ИНАЧЕ ДЛ_ПараметрыНГГ.Наименование
	|	КОНЕЦ КАК ТипПеревозки,
	|	ДЛ_ПараметрыНГГ.Длина КАК Длина,
	|	ДЛ_ПараметрыНГГ.Ширина КАК Ширина,
	|	ДЛ_ПараметрыНГГ.Высота КАК Высота,
	|	ДЛ_ПараметрыНГГ.Вес КАК Вес,
	|	ВЫБОР
	|		КОГДА ДЛ_ПараметрыНГГ.Объем = ""0""
	|			ТОГДА ""-""
	|		ИНАЧЕ ДЛ_ПараметрыНГГ.Объем
	|	КОНЕЦ КАК Объем
	|ИЗ
	|	Справочник.ДЛ_ПараметрыНГГ КАК ДЛ_ПараметрыНГГ
	|ГДЕ
	|	НЕ ДЛ_ПараметрыНГГ.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДЛ_ПараметрыНГГ.Наименование"; 
	
	ТаблицаНГГ.Загрузить(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры
